package ch02.sec01;

public class PrimitiveType {
    public static void main(String[] args) {
        /*
        기본(원시) 타입 (Primitive Type) - 총 8개
        정수 : byte(1바이트), short(2바이트), int(4바이트), long(8바이트)
        실수 : float(4바이트), double(8바이트)
        문자 : char(2바이트)
        논리 : boolean(1바이트)

        모두 타입명이 소문자로 구성

        원시 타입에는 값이 저장되고 참조 타입은 주소값이 저장된다

        23(10진수)> 10111(2진수) 23/2 몫:11 나머지 1 11/2 > 몫 5 나머지 1 5/2 > 몫 2 나머지 1 2/2 몫 1 나머지 0
                    마지막 몫+ 나머지 거꾸로 올라감 10111
        10111(2진수) > 23  : 5자리니까 2의 4승부터 2의0승(1이다)까지 다 더한 값 16+0+4+2+1  두번째 자리는 0이라서 0

        16 (2진수로 바꾸기)> 10000

        1010101(2진수) > 85

        23(10진수) > (8진수) 027 / 2진수랑 비슷한데 8로 나눔

        55 (10진수) > (8진수) 067
        */
    }
}
